# Data Wrangler Demo with WestRoxbury Dataset

This notebook demonstrates how to use Data Wrangler in VS Code Codespaces.

In [1]:
import pandas as pd
import numpy as np

# Load the WestRoxbury dataset
df = pd.read_csv('../data/WestRoxbury.csv')

# Display basic info about the dataset
print("Dataset shape:", df.shape)
print("\nColumn names:")
print(df.columns.tolist())

# Show first few rows
df.head()

Dataset shape: (5802, 14)

Column names:
['TOTAL VALUE ', 'TAX', 'LOT SQFT ', 'YR BUILT', 'GROSS AREA ', 'LIVING AREA', 'FLOORS ', 'ROOMS', 'BEDROOMS ', 'FULL BATH', 'HALF BATH', 'KITCHEN', 'FIREPLACE', 'REMODEL']

,TOTAL VALUE,TAX,LOT SQFT,YR BUILT,GROSS AREA,LIVING AREA,FLOORS,ROOMS,BEDROOMS,FULL BATH,HALF BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,NaN
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,NaN
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,NaN
4,331.5,4170,5000,1910,2370,1438,2.0,7,3,2,0,1,0,NaN

## Using Data Wrangler

Once you run the cell above, you should see an **"Open in Data Wrangler"** button appear next to the DataFrame output.

### Steps to use Data Wrangler:

1. **Click the "Open in Data Wrangler" button** that appears next to the DataFrame
2. **Explore your data** in the interactive interface
3. **Apply transformations** using the visual interface
4. **Generate code** for your transformations
5. **Export** the cleaned data back to your notebook

In [ ]:
# This cell will contain the generated code from Data Wrangler
# After using Data Wrangler, you can paste the generated code here

# Example of what Data Wrangler might generate:
# df_cleaned = df.copy()
# df_cleaned = df_cleaned.dropna()
# df_cleaned = df_cleaned[df_cleaned['column_name'] > 0]

print("Paste your Data Wrangler generated code here!")